tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Software environment for statistical computing
brew "r"
# Open source continuous file synchronization application
brew "syncthing"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application launcher and productivity software
cask "alfred"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Web browser
cask "firefox"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Automated organization
cask "hazel"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organized
cask "notion"
# PDF reader, editor and annotator
cask "pdf-expert"
# Collect, organize & share colors
cask "sip"
# LaTeX editor
cask "texmaker"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Craft", id: 1487937127
mas "Day One", id: 1055511498
mas "Drafts", id: 1435957248
mas "Flow", id: 1423210932
mas "Hush", id: 1544743900
mas "Library Access", id: 1480670663
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Slack", id: 803453959
mas "WhatsApp", id: 1147396723
